translations = {
    'en':{
        "Извините, бот временно отключен.":  "Sorry, the bot is temporarily disabled.",
        "Я прочитал соглашение и принимаю условия": "I have read the agreement and accept the terms and conditions",
        "Чтобы продолжить, ты должен согласиться с условиями пользования магазином.":
            "To continue, you must agree to the store's terms of use.",
        "Зарегистрировался новый пользователь:": "A new user has registered:",
        "Начать!": "Let's go!",
        "Вы приняли условия соглашения ✅ Теперь можете пользоваться ботом":
            "You have accepted the terms of the agreement ✅ Now you can use the bot.",
        "Канал": "Channel",
        "Подпишитесь на телеграм чаты и повторите попытку ⬇": "Subscribe to telegram chats and try again ⬇",
        "Все категории": "All categories",
        "Наличие товаров": "Product availability",
        "Профиль": "Profile",
        "Добро пожаловать в наш магазин!": "Welcome to our store!",
        "К сожалению, вы не являетесь администратором": "Unfortunately, you are not an administrator",
        "Настройки бота": "Bot settings",
        "Управление пользователями": "User management",
        "Редактирование товаров": "Editing products",
        "Управление рассылками": "Managing mailings",
        "Поиск заказа": "Order search",
        "Бот": "Bot",
        "Ник": "Nickname",
        "Статус": "Status",
        "Тариф": "Plan",
        "Создан": "Created",
        "Информация о пользователях": "User information",
        "Поиск пользователя по ID": "User search by ID",
        "Поиск пользователя по TELEGRAM_ID": "User search by TELEGRAM_ID",
        "Поиск пользователя по USERNAME": "User search by USERNAME",
        "Отмена": "Cancel",
        "Введите ID пользователя:": "Enter the user ID:",
        "Введите TELEGRAM_ID пользователя:": "Enter the user TELEGRAM_ID:",
        "Введите USERNAME пользователя": "Enter the user USERNAME",
        "Пользователь с указанным ID не найден": "User with specified ID not found",
        "Пользователь с указанным TELEGRAM_ID не найден": "User with specified TELEGRAM_ID not found",
        "Пользователь с указанным USERNAME не найден": "User with specified USERNAME not found",
        "Посмотреть заказы": "View orders",
        "Отправить сообщение": "Send a message",
        "Заблокировать": "Ban",
        "Разблокировать": "Unban",
        "Не существует": "Missing",
        "Имя": "Name",
        "Фамилия": "Surname",
        "Текущий баланс": "Current balance",
        "Дата регистрации": "Date of registration",
        "Всего у Вас заказов": "Your total orders",
        "Всего у Вас пополнений": "Your total refills",
        "Заказ": "Order",
        "Время заказа": "Order time",
        "Итоговая сумма": "Total amount",
        "Страница": "Page",
        "из": "in",
        "Вперёд": "Next",
        "В конец": "Last",
        "Введите сообщение, которое отправить пользователю": "Enter a message to send to the user",
        "Сообщение успешно отправлено": "Message successfully sent",
        "Отправка сообщения не удалась": "Sending a message failed",
        "Вы заблокированы": "You're banned",
        "Пользователь был заблокирован": "The user has been banned",
        "Пользователь был разблокирован": "The user has been unbanned",
        "Добавить рассылку": "Add mailing",
        "Сформировать и запустить рассылку": "Generate and launch a mailing",
        "Добро пожаловать в меню управления рассылками": "Welcome to the mailing management menu",
        "Отправьте фото/медиа группу/гиф/текст для рассылки": "Send a photo/media group/gif/text for mailing",
        "Включен": "Enabled",
        "Выключен": "Disabled",
        "Уведомление о сделках [вкл]": "Order Notification [on]",
        "Уведомление о сделках [выкл]": "Order Notification [off]",
        "Уведомление о пользователях [вкл]": "User Notification [on]",
        "Уведомление о пользователях [выкл]": "User Notification [off]",
        "Назад": "Back",
        "Настройки": "Settings",
        "Да": "Yes",
        "Нет": "No",
        "Всё верно?": "All right?",
        "Рассылка была отменена": "The mailing was canceled",
        "Добавить текст": "Add text",
        "Если текст не отобразился, нажмите на кнопку -Добавить текст- ⬇":
            "If the text does not appear, click on the 'Add Text' button ⬇",
        "Отправьте текст, который хотите добавить": "Send the text you want to add",
        "Изменить": "Edit",
        "Запустить": "Run",
        "Получить тестовое сообщение": "Get a test message",
        "Удалить": "Remove",
        "Создано": "Created",
        "Завершено": "Completed",
        "Информация": "Information",
        "Всего отправлено": "Total sent",
        "Успешно": "Successfully",
        "С ошибкой": "With error",
        "Текст": "Text",
        "Медиа": "Media",
        "Что хотите изменить?": "What do you want to change?",
        "Отправьте новое медиа ⬇": "Send new media ⬇",
        "Изменения успешно сохранены ✅": "Changes successfully saved ✅",
        "Вернуться в админ панель": "Back to admin panel",
        "Отправьте новый текст ⬇": "Send a new text ⬇",
        "Рассылка завершена": "The mailing has been completed",
        "Неуспешно": "Unsuccessfully",
        "Рассылка успешно удалена ✅": "Mailing successfully deleted ✅",
        "Введите id заказа": "Enter order id",
        "id покупателя": "buyer id",
        "Товар": "Product",
        "Сумма заказа": "Order amount",
        "Способ оплаты": "Method of payment",
        "Посмотреть заказ на сайте": "View order on the website",
        "Посмотреть товар": "View product",
        "Сделать возврат": "Make a refund",
        "Товар не был найден": "The product was not found",
        "Укажите процент от суммы заказа для возврата на баланс (0-100%)(Только число)":
            "Specify the percentage of the order amount to be refunded to the balance (0-100%)(Number only)",
        "Процент должен быть в диапазоне от 0 до 100. Введите корректный процент возврата.":
            "The percentage must be between 0 and 100. Enter the correct return percentage.",
        "Баланс успешно зачислен": "Balance successfully credited",
        "Пришёл возврат в размере": "A refund in the amount of",
        "за заказ": "per order",
        "Введите корректный процент": "Enter the correct percentage",
        "Выберите категорию": "Select a category",
        "История заказов": "Order history",
        "Реферальная система": "Referral system",
        "Активировать купон": "Activate coupon",
        "Пополнить баланс" : "Top up balance",
        "История пополнений": "Payments history",
        "В начало": "First",
        "Введите промокод": "Enter promo code",
        "Данный купон не обнаружен": "This coupon has not been detected",
        "История начислений": "Accrual history",
        "Рефералы": "Referrals",
        "Реферальная ссылка отдельным сообщением": "Referral link in a separate message",
        "В боте включена реферальная система. "
        "Приглашайте друзей изарабатывайте на этом! Вы будете получать: "
        "10% от каждой покупки вашего реферала. "
        "Ваша реферальная ссылка:":
            "The bot includes a referral system. "
            "Invite your friends and earn on it! "
            "You will receive: 10% of each purchase of your referral. "
            "Your referral link:",
        "Отправьте сумму пополнения:": "Send recharge amount:",
        "Выберите платёжную систему": "Select a payment system",
        "Введите корректную сумму.": "Enter correct amount.",
        "Изменить название": "Change name",
        "Изменить описание": "Change description",
        "Изменить цену": "Change price",
        "Название было успешно изменено": "Name was successfully changed",
        "Описание было успешно изменено": "Description was successfully changed",
        "Цена была успешно изменена": "Price was successfully changed",
        "Введите корректное название товара": "Enter correct product name",
        "Введите корректное описание товара": "Enter correct product description",
        "Цена не может быть меньше 0. Введите корректную сумму.":
            "Price cannot be less than 0. Enter correct amount.",
        "Введите описание товара:": "Enter product description:",
        "Введите корректное имя товара:": "Enter correct product name:",
        "Введите цену товара:": "Enter price of item:",
        "Вернуться в категорию": "Back to category",
        "успешно добавлен!": "successfully added!",
        "Поиск товара по ID завершён.": "Product search by ID is complete.",
        "Товар с таким ID не найден": "Product with this ID was not found",
        "Перейти к товару": "Go to product",
        "Найден товар:": "Found product:",
        "Введите некорректное ID": "Enter incorrect ID",
        "Завершить": "Finish",
        "Кол-во:": "Quantity: ",
        "шт.": "pieces",
        "Вернуться": "Back",
        "Выберите нужный товар:": "Select the product you want:",
        "Загрузка файла была отменена": "File upload was canceled",
        "Файл" : "File",
        "был успешно добавлен: ": "Was successfully added",
        "При добавлении файла произошла ошибка и он не был добавлен.":
            "An error occurred when adding the file and it was not added.",
        "Загрузка файлов успешно завершена": "File upload successfully completed",
        "Товар был успешно добавлен": "Product was successfully added",
        "При добавлении товара произошла ошибка и он не был добавлен.":
            "An error occurred when adding the product and it was not added.",
        "Вами был отправлен не .txt файл. Новый товар не добавлен.":
            "The file you sent was not a .txt file. No new product has been added.",
        "При выгрузке данных произошла ошибка": "An error occurred during data unloading",
        "Товары для выгрузки отсуствуют": "Products for unloading are missing",
        "Выгруженные файлы:": "Unloaded files:",
        "Выгрузка товара": "Unloading of products",
        "Данные были успешно выгружены": "The data was successfully unloaded",
        "Пожалуйста, отправьте только число или *": "Please send only a number or *",
        "Создать новый товар": "Create a new product",
        "Назад ко всем категориям": "Back to all categories",
        "Выберите категорию:": "Select a category:",
        "Редактировать": "Edit",
        "Добавить товар": "Add product",
        "Выгрузить товар": "Unload product",
        "Подтверждаю": "Confirm",
        "Подтвердить": "Confirm",
        "был отменен": "was canceled",
        "На вашем счету недостаточно средств.": "There are insufficient funds in your account.",
        "Требуется для покупки": "Required to buy",
        "Уведомление о покупке": "Purchase Notice",
        "Смотреть каталог": "View catalog",
        "Искать по имени": "Search by name",
        "Я знаю ID товара": "I know the product ID",
        "Как будем искать товар?": "How are we going to find the product?",
        "Введите название товара для его поиска:": "Enter a product name to search for it:",
        "Введите ID товара. Если хотите выйти из поиска введите -Завершить-.":
            "Enter the product ID. If you want to exit the search, enter 'Finish'.",
        "Введите новое название товара": "Enter a new product name",
        "Введите новое описание товара": "Enter a new product description",
        "Введите новую цену товара": "Enter a new product price",
        "Выбранный товар является <b>уникальным товаром</b>\n"
        "Для его пополнения требуется отправить либо:\n"
        "1. Сообщение, где каждая строка - 1 товар\n"
        "2. txt файл, где каждая строка - 1 товар":
            "The selected product is <b>unique product</b>\n"
            "To replenish it you need to send either:\n"
            "1. Message, where each line is 1 product\n"
            "2. .txt file, where each line is 1 product",
        "Выбранный товар является <b>неуникальным товаром</b>\n"
        "Для его пополнения требуется отправить: \n"
        "Сообщение, которое будет являться товаром":
            "The selected product is a <b>non-unique product</b>."
            "To replenish it, you need to send: \n"
            "Message that will be a product",
        "Выбранный товар является <b>уникальным файлом</b>\n"
        "Для его пополнения требуется отправить: \n"
        "Файлы, которые будут являться товаром.\n"
        "Для завершения отправьте -Завершить-":
            "The selected product is a <b>unique file</b>\n"
            "To replenish it, you need to send: \n"
            "Files that will be the product. \n"
            "To complete, send -Complete-",
        "Выбранный товар является <b>неуникальным файлом</b>\n"
        "Для его пополнения требуется отправить: \n"
        "1 файл, который будет являться товаром.\n"
        "Для отмены отправьте -Завершить-":
            "The selected item is a <b>non-unique file</b>\n"
            "To replenish it, you must send: \n"
            "1 file, which will be the product.\n"
            "To cancel, send -Complete-",
        "Выбранный товар является <b>услугой</b>\n"
        "Для его пополнения требуется отправить: \n"
        "Cообщение, которое будет являться товаром.\n"
        "Для отмены отправьте -Завершить-":
            "The selected item is a <b>service</b>\n"
            "To refill it, you need to send: \n"
            "Send a message that will be the product.\n"
            "To cancel, send -Complete-",
        "Выбранный товар является <b>уникальным подарком</b>\n"
        "Для его пополнения требуется отправить либо:\n"
        "1. Сообщение, где каждая строка - 1 товар\n"
        "2. txt файл, где каждая строка - 1 товар":
            "The selected product is <b>unique gift</b>\n"
            "To replenish it you need to send either:\n"
            "1. Message, where each line is 1 product\n"
            "2. .txt file, where each line is 1 product",
        "Выбранный товар является <b>неуникальным подарком</b>\n"
        "Для его пополнения требуется отправить: \n"
        "Сообщение, которое будет являться товаром":
            "The selected product is a <b>non-unique gift</b>."
            "To replenish it, you need to send: \n"
            "Message that will be a product",
        "Отправьте кол-во товара, которое хотите выгрузить": "Send the quantity of products you want to unload",
        "В наличии:": "Available:",
        "в наличии": "available",
        "Чтобы выгрузить всё отправьте *": "To unload everything, send *",
        "Уникальный товар": "Unique product",
        "Неуникальный товар": "Non-unique product",
        "Уникальный файл": "",
        "Неуникальный файл": "",
        "Услуга":"",
        "Уникальный подарок": "",
        "Неуникальный подарок": "",
        "Выберите тип товара:": "Select a product type:",
        "Введите название товара:": "Enter product name:",
        "Описание": "Description",
        "Количество": "Quantity",
        "Вы действительно хотите купить?": "Do you really want to buy?",
        "За день новых": "Today",
        "За неделю новых": "This week",
        "За месяц новых": "This month",
        "Всего пользователей": "Total users",
        "Активные": "Active",
        "Неактивные": "Inactive",
        "Информация о заказах": "Order Information",
        "Вчера":"Yesterday",
        "За прошлую неделю": "Last week",
        "За прошлый месяц": "Last month",
        "Позавчера": "Two days ago",
        "За позапрошлую неделю": "Two weeks ago",
        "За позапрошлый месяц": "Two months ago",
        "Всего заказов": "Total orders",
        "отсутствует": "missing",
        "Админ панель": 'Admin panel',
        "Изменить язык": "Change language",
        "Язык был успешно изменен на": "Language was successfully changed to",
        "Выберите язык:": "Select language:",
        "Извините, бот временно выключен.": "Sorry, the bot is temporarily disabled.",
        "🏘 Меню": "🏘 Menu"

    }
}

def _(text, lang='ru'):
    global translations
    if lang == 'ru':
        #lang = 'en'
        try:
            return translations[lang][text]
        except:
            return text
    else:
        try:
            return translations[lang][text]
        except:
            print(f'Ошибка при переводе: {text}, {lang}')
            return text